Repository: ArthurVinbeau/mosaic
Catalog: lib/l10n/app_*.arb
Languages: fr

# appTitle
source: Mosaic
fr: Mosaïque

source: Resume game
fr: Reprendre la partie

source: Restart game
fr: Redémarrer la partie

# lightTheme
source: Light
fr: Clair

# darkTheme
source: Dark
fr: Sombre

# platformTheme
source: Use platform theme
fr: Utiliser le thème de l'appareil

# themePickerTitle
source: Theme Picker
fr: Choix du thème

# brightnessPreference
source: Theme brightness preference :
fr: Préférence de luminosité du thème :

# tutorialTitle
source: Tutorial
fr: Tutoriel

source: Previous
fr: Précédent

source: Next
fr: Suivant

source: Finish
fr: Terminer

# beginnerLevel
source: Beginner
fr: Débutant

# easyLevel
source: Easy
fr: Facile

# intermediateLevel
source: Intermediate
fr: Intermédiaire

# challengerLevel
source: Challenger
fr: Difficile

# hardLevel
source: Hard
fr: Très difficile

# extremeLevel
source: Extreme
fr: Extrême

# customLevel
source: Custom
fr: Personnalisé

source: Board Height
fr: Hauteur

source: Board Width
fr: Largeur

# boardSizeError
source: {label} must be a valid number and be greater or equal to {min}
fr: La {label} doit être un nombre valide et être supérieur ou égal à {min}

# difficultyPickerHeader
source: Pick a difficulty
fr: Choix de la difficulté

source: New Game
fr: Nouvelle partie

# generatingBoard
source: Generating a new board...
fr: Génération du nouveau plateau...

# tutorialStep0
source: Fill the board by following the clues to win the game. Each clue represents the amount of &f;black tiles in a 3x3 square around it, including the clue's own tile.
fr: Remplissez le plateau en suivant les indices pour remporter la partie. Chaque indice représente le nombre de cases &f;noires dans un carré de 3x3 l'entourant, y-compris la case de l'indice.

# tutorialStep1
source: According to the clues, this square is composed of &e;white tiles only. Tap on a tile to change its color, a long tap will cycle the colors in the reverse order
fr: D'après les indices, ce carré est uniquement composé de cases &e;blanches. Touchez une case pour changer sa couleur, restez appuyé utiliser un cycle inverse de couleurs.

# tutorialStep2
source: These two tiles must be filled in &f;black. Tap on a tile to change its color, a long tap will cycle the colors in the reverse order
fr: Ces deux cases doivent être remplies de &f;noir. Touchez une case pour changer sa couleur, restez appuyé utiliser un cycle inverse de couleurs.

# tutorialStep3
source: The ink bucket might come in handy to help you fill the board faster, using it on a tile will color all &u;unfilled tiles in a 3x3 square around your tap.
fr: Le pot de peinture est pratique pour remplir le plateau plus rapidement, l'utiliser sur une case va remplir toutes les cases &u;vides dans un carré de 3x3 autour du point d'impact.

# tutorialStep4
source: Congratulations, you've finished the tutorial! On bigger boards you might want to pinch to zoom in and drag to move the board in order to have a better experience.
fr: Félicitations, vous avez terminé le tutoriel ! Vous pouvez pincer et pousser le plateau pour zoomer et vous déplacer ce qui peut vous aider sur de plus grands plateaux.

source: {elapsed} seconds
fr: {elapsed} secondes

# elapsedMinutes
source: {elapsed} minutes and {secondsString}
fr: {elapsed} minutes et {secondsString}

# elapsedHours
source: {elapsed} hours, {minutesAndSecondsString}
fr: {elapsed} heures, {minutesAndSecondsString}

source: You win!
fr: Vous avez gagné !

# winDescription
source: You took {elapsed} to finish this {height}x{width} board!
fr: Vous avez pris {elapsed} pour remplir ce plateau de {height}x{width}!

source: Dismiss
fr: Fermer

# restartConfirmation
source: Restart the current game?
fr: Redémarrer la partie actuelle ?

# restartConfirmationDescription
source: You will lose your current progress
fr: Vous perdrez votre progression actuelle

# confirmDialog
source: yes
fr: oui

# denyDialog
source: no
fr: non

# cancelDialog
source: cancel
fr: annuler

# settingsTitle
source: Settings
fr: Paramètres

# themeSettingsButton
source: Theme settings
fr: Paramètres des thèmes

# localePicker
source: Select your locale preference :
fr: Préférence de langue :

source: Use system locale
fr: Utiliser la langue de l'appareil

# themePrimaryColor
source: Primary color
fr: Couleur principale

# themeMenuBackground
source: Menu background
fr: Fond du menu

# themeGameBackground
source: Game background
fr: Fond du plateau

# themeCellBase
source: Base cell
fr: Case de base

# themeCellEmpty
source: Empty cell
fr: Case vide

# themeCellFilled
source: Filled cell
fr: Case remplie

# themeCellTextBase
source: Base cell text
fr: Texte de case de base

# themeCellTextEmpty
source: Empty cell text
fr: Texte de case vide

# themeCellTextFilled
source: Filled cell text
fr: Texte de case remplie

# themeCellTextError
source: Cell text error
fr: Texte d'erreur

# themeCellTextComplete
source: Cell text complete
fr: Texte de case terminée

# themeControlsMoveEnabled
source: Controls enabled
fr: Contrôle activé

# themeControlsMoveDisabled
source: Controls disabled
fr: Contrôle désactivé

source: Discard changes?
fr: Annuler les changements ?

# cannotBeUndone
source: This action cannot be undone.
fr: Cette action est définitive.

# loseThemeChanges
source: You will lose all the modifications you made to this theme.
fr: Vous perdrez toutes les modifications apportées à ce thème

source: Save and exit
fr: Sauvegarder et fermer

source: Delete theme?
fr: Supprimer le thème ?

# deleteThemeBody
source: This will remove {name} from your theme list.
fr: Cela supprimera {name} de votre liste de thèmes.

source: delete
fr: supprimer

source: Import theme
fr: Importer le thème

source: import
fr: importer

# forbiddenCharacters
source: You must not use any of the following characters: {characters}
fr: Vous ne devez pas utiliser lez caractères suivants : {characters}

# mustNotBeEmpty
source: This field must not be empty
fr: Ce champ ne doit pas être vide.

source: Copy game seed
fr: Copier la seed

# copiedGameSeed
source: Copied game seed to clipboard
fr: La seed a été copiée dans le presse-papier.
